app/controllers/short_urls_controller.rb

INSERT INTO `short_urls` (`full_url`, `created_at`, `updated_at`) VALUES ('http://www.youtube.com.br', '2021-05-21 02:27:59.931515', '2021-05-21 02:27:59.931515')
---
  def create
    full_url = params[:full_url]
    @short_url = ShortUrl.create_or_select_with_full_url full_url