app/models/short_url.rb

SELECT `short_urls`.* FROM `short_urls` WHERE (full_url='http://www.google.com.br') ORDER BY `short_urls`.`id` ASC LIMIT 1
INSERT INTO `short_urls` (`full_url`, `created_at`, `updated_at`) VALUES ('http://www.youtube.com.br', '2021-05-21 02:27:59.931515', '2021-05-21 02:27:59.931515')
---
  def self.create_or_select_with_full_url full_url

    short_url = ShortUrl.where("full_url=?",full_url).first
    unless short_url
      short_url = ShortUrl.create(full_url: full_url)

SELECT `short_urls`.* FROM `short_urls`
---
  def self.find_by_short_code short_code

    short_url = ShortUrl.all.find {|x| x.short_code == short_code}

SELECT `short_urls`.* FROM `short_urls`
UPDATE `short_urls` SET `short_urls`.`click_count` = 1, `short_urls`.`updated_at` = '2021-05-21 02:26:10.384366' WHERE `short_urls`.`id` = 3
---
  def update_title!
    uri_requested = URI(self.full_url)
    result = Net::HTTP.get_response(uri_requested)
    title = result.body.scan(/<title>(.*?)<\/title>/).flatten.first
    self.title = title
    self.save